app/controllers/films_controller.rb

  def index
   @films = Film.all.order('created_at DESC').page(params[:page]).per_page(6)
---
SELECT  "films".* FROM "films" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 6], ["OFFSET", 0]]
SELECT COUNT(*) FROM "films"

  def show
   @film = Film.find(params[:id])
---
SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @film = Film.find(params[:id])
---
SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @film = Film.find(params[:id])
    @film.destroy
---
SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "films" WHERE "films"."id" = ?  [["id", 2]]

  def create
  @film = Film.new(film_params)

    if @film.save
---
INSERT INTO "films" ("title", "director", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["director", "test"], ["year", "testy"], ["created_at", 2017-03-06 18:25:02 UTC], ["updated_at", 2017-03-06 18:25:02 UTC]]

  def update
  @film = Film.find(params[:id])

  if @film.update(film_params)
---
SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "films" SET "year" = ?, "updated_at" = ? WHERE "films"."id" = ?  [["year", "12312"], ["updated_at", 2017-03-17 20:02:27 UTC], ["id", 1]]