app/controllers/films_controller.rb

  def index
   @films = Film.all
---
SELECT "films".* FROM "films"